apps/clustercomposer/app/controllers/azhpcclusters_controller.rb

  def index
    @default_template = Template.default
    @templates = Template.all

    @selected_id = session[:selected_id]
    session[:selected_id] = nil
    #@azhpcclusters = Azhpccluster.preload(:azhpcclusters)
    @azhpcclusters = Azhpccluster.all
---
SELECT "azhpcclusters".* FROM "azhpcclusters"